In [1]:
import pandas as pd
import numpy as np

# Define Datasets

In [4]:
df_a = pd.DataFrame({"Client_id":[10,12,34,58,59,74,14,59], "Name":["Peter", "Joseph", "Arthur", "Hector", \
                                                                   "Lea", "Alicia", "Meredith", "Lisa"]})
df_b = pd.DataFrame({"Client_id":[10,12,34,58,59,74,14,59], "Quantity":[2,1,2,3,1,1,1,2]})

In [5]:
df_a.head()

   Client_id    Name
0         10   Peter
1         12  Joseph
2         34  Arthur
3         58  Hector
4         59     Lea

In [6]:
df_b.head()

   Client_id  Quantity
0         10         2
1         12         1
2         34         2
3         58         3
4         59         1

# Merge Datasets

Method with merge :

In [8]:
df_merged = df_a.merge(df_b, on='Client_id', how='inner')

In [9]:
df_merged.head()

   Client_id    Name  Quantity
0         10   Peter         2
1         12  Joseph         1
2         34  Arthur         2
3         58  Hector         3
4         59     Lea         1

Or :

In [12]:
df_merged_2 = df_a.join(df_b, lsuffix='_clients_table', rsuffix='_orders_table')

In [13]:
df_merged_2.head()

   Client_id_clients_table    Name  Client_id_orders_table  Quantity
0                       10   Peter                      10         2
1                       12  Joseph                      12         1
2                       34  Arthur                      34         2
3                       58  Hector                      58         3
4                       59     Lea                      59         1

This is not exactly what we want but we can fix it by dropping the useless column and renaming the other one.

In [18]:
df_merged_2.rename(columns={'Client_id_clients_table':'Clients_id'}, inplace = True)
df_merged_2.drop(['Client_id_orders_table'], axis = 1, inplace = True)
df_merged_2.head()

   Clients_id    Name  Quantity
0          10   Peter         2
1          12  Joseph         1
2          34  Arthur         2
3          58  Hector         3
4          59     Lea         1

However, this method is kind of ugly. If you want to use join() at all cost, first change the indices :

In [23]:
df_merged_2 = df_a.set_index('Client_id').join(df_b.set_index('Client_id'))
df_merged_2.head()

               Name  Quantity
Client_id
10            Peter         2
12           Joseph         1
14         Meredith         1
34           Arthur         2
58           Hector         3

Join() is a wrapping of merge() designed for specific cases. From what I understand, it works properly if the two Dataframes share the same index. If they have columns in commun, it is mandatory to precise lsuffix and rsuffix.

I suspect that join is a bit more complex than this, but this should be ok for now.

### Exercise Idea

Instead of just putting a "Quantity" column in the orders dataframe, put one column with all the articles ordered by the client as one single string. Then get the list of all possible articles and turn the dataframe in a one hot encoding version of the clients' orders (One column per product and True or False depending on whether the clients ordered the product or not).